tutorials/coriolisABLFoam/standardKepsilon/windVeering_FengAndGu2020_zeroGradient_fe32/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0 3)
    (0 0 3)
    (0 -1 0)
    (1 -1 0)
    (1 -1 3)
    (0 -1 3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 50 10) simpleGrading (1 6.5 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sideLeft
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    sideRight
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomRoughWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
